---
kind: property
id: P:Autodesk.Revit.DB.Face.MaterialElementId
source: html/0f496bcd-fd05-f1dc-6cc7-d496541fd6ae.htm
---
# Autodesk.Revit.DB.Face.MaterialElementId Property

The element ID of the material from which this face is composed.

## Syntax (C#)
```csharp
public ElementId MaterialElementId { get; }
```